//1. Создайте массив с 4 элементами. Выведите в консоль второй элемент массива.

// let arr = ["apple","orange","task","JavaScript"]
// console.log(arr[1])
//=========================================================================================

//2. Создайте массив с 5-ю числами. Получите первое с конца число и проверьте его 
//на четность. Выведите  результат в консоль.

// let arr = [2,3,4,5,314,65,3]
// let last_el_arr = arr.slice(-1)
// if(last_el_arr %2 == 0){
//     console.log(`${last_el_arr} :четный`)
// }else{
//     console.log(`${last_el_arr} :не четный`)
// }
//=========================================================================================

//3. Используйте prompt(), чтобы получить случайное число от пользователя. 
// Затем добавьте это число, его половину и четверть в массив и выведите результат в консоль сумму всех чисел. 

//1==СПОСОБ

// let num_klient = 4
// let половина = num_klient / 2
// let четверть = num_klient / 4
// let sum = num_klient + половина + четверть
// console.log(sum)

//.........................................................................
//2==СПОСОБ

// let num_client = 5
// let new_arr = []
// new_arr.push(num_client);          
// new_arr.push(num_client / 2);      
// new_arr.push(num_client / 4);

// let sum = new_arr.reduce((current,next)=> current+next)
// console.log(sum)
//=========================================================================================

