// Создайте массив с 4 элементами. Выведите в консоль второй элемент массива.

// let array = ["apple", "orange", "coconut", "mango"];
// console.log(array[1]);

//  --------------------------------------------------------------------------------------------------
// Создайте массив с 5-ю числами. Получите первое с конца число и проверьте его 
// на четность. Выведите  результат в консоль.

// let nums = [1,2,3,4,5]
// let last_num = nums.slice(-1)
// if(last_num % 2 == 0){
//     console.log("ваше последнее число в массиве ЧЕТНАЯ")
// }else{
//     console.log("ваше последнее число в массиве НЕ ЧЕТНАЯ")
// }

//  --------------------------------------------------------------------------------------------------

